# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Setup
brew "git"
brew "zsh"
brew "zsh-autosuggestions"
brew "tmux"
brew "stow"
brew "neovim"
brew "neofetch"

# Password manager that keeps all passwords secure behind one password
cask "1password"
# Open-source code editor
cask "visual-studio-code"
# Browser
cask "firefox"

# Tools
cask "raycast"
cask "iterm2"
cask "jetbrains-toolbox"
cask "obsidian"
#
# Fonts
cask "font-hack-nerd-font"
